There is a circular chain of references among the highlighted elements.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CircularDependencyError { get; }
  Visual Basic
Public Shared ReadOnly Property CircularDependencyError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CircularDependencyError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RegenFailures Class
  Autodesk.Revit.DB Namespace